# 3

## 3.1

In [14]:
import pandas as pd

In [15]:
# 다음 두 줄은 결과가 동일합니다.
pd.read_csv(filepath_or_buffer="../DATA/pokemon.csv")
file = "../DATA/pokemon.csv"

In [16]:
pd.read_csv("../DATA/pokemon.csv")

         Pokemon            Type
0      Bulbasaur  Grass / Poison
1        Ivysaur  Grass / Poison
2       Venusaur  Grass / Poison
3     Charmander            Fire
4     Charmeleon            Fire
..           ...             ...
804    Stakataka    Rock / Steel
805  Blacephalon    Fire / Ghost
806      Zeraora        Electric
807       Meltan           Steel
808     Melmetal           Steel

[809 rows x 2 columns]

In [17]:
pd.read_csv("../DATA/pokemon.csv", index_col = "Pokemon")

                       Type
Pokemon
Bulbasaur    Grass / Poison
Ivysaur      Grass / Poison
Venusaur     Grass / Poison
Charmander             Fire
Charmeleon             Fire
...                     ...
Stakataka      Rock / Steel
Blacephalon    Fire / Ghost
Zeraora            Electric
Meltan                Steel
Melmetal              Steel

[809 rows x 1 columns]

In [18]:
# pokemon = pd.read_csv("../DATA/pokemon.csv", index_col="Pokemon").sqeeze()
pokemon = file.squeeze()
pokemon

AttributeError: 'str' object has no attribute 'squeeze'

In [19]:
pd.read_csv("../DATA/google_stocks.csv").head()

         Date  Close
0  2004-08-19  49.98
1  2004-08-20  53.95
2  2004-08-23  54.50
3  2004-08-24  52.24
4  2004-08-25  52.80

In [20]:
pd.read_csv("../DATA/google_stocks.csv", parse_dates=["Date"]).head()

        Date  Close
0 2004-08-19  49.98
1 2004-08-20  53.95
2 2004-08-23  54.50
3 2004-08-24  52.24
4 2004-08-25  52.80

In [21]:
google =pd.read_csv(
    "../DATA/google_stocks.csv",
    parse_dates=["Date"],
    index_col="Date").squeeze()
google.squeeze().head()

Date
2004-08-19    49.98
2004-08-20    53.95
2004-08-23    54.50
2004-08-24    52.24
2004-08-25    52.80
Name: Close, dtype: float64

In [22]:
pd.read_csv("../DATA/revolutionary_war.csv").tail()

                         Battle  Start Date     State
227         Siege of Fort Henry   9/11/1782  Virginia
228  Grand Assault on Gibraltar   9/13/1782       NaN
229   Action of 18 October 1782  10/18/1782       NaN
230   Action of 6 December 1782   12/6/1782       NaN
231   Action of 22 January 1783   1/22/1783  Virginia

In [23]:
pd.read_csv(
            "../DATA/revolutionary_war.csv",
            index_col="Start Date",
            parse_dates=["Start Date"]).tail()

                                Battle     State
Start Date
1782-09-11         Siege of Fort Henry  Virginia
1782-09-13  Grand Assault on Gibraltar       NaN
1782-10-18   Action of 18 October 1782       NaN
1782-12-06   Action of 6 December 1782       NaN
1783-01-22   Action of 22 January 1783  Virginia

In [24]:
pd.read_csv(
            "../DATA/revolutionary_war.csv",
            index_col="Start Date",
            parse_dates=["Start Date"],
            usecols=["State", "Start Date"]).squeeze().tail()

Start Date
1782-09-11    Virginia
1782-09-13         NaN
1782-10-18         NaN
1782-12-06         NaN
1783-01-22    Virginia
Name: State, dtype: object

In [25]:
battles = pd.read_csv(
            "../DATA/revolutionary_war.csv",
            index_col="Start Date",
            parse_dates=["Start Date"],
            usecols=["State", "Start Date"],
            ).squeeze()
battles

Start Date
1774-09-01    Massachusetts
1774-12-14    New Hampshire
1775-04-19    Massachusetts
1775-04-19    Massachusetts
1775-04-20         Virginia
                  ...
1782-09-11         Virginia
1782-09-13              NaN
1782-10-18              NaN
1782-12-06              NaN
1783-01-22         Virginia
Name: State, Length: 232, dtype: object

## 3.2

### 3.2.1

In [26]:
google.sort_values()

Date
2004-09-03      49.82
2004-09-01      49.94
2004-08-19      49.98
2004-09-02      50.57
2004-09-07      50.60
               ...
2019-04-23    1264.55
2019-10-25    1265.13
2018-07-26    1268.33
2019-04-26    1272.18
2019-04-29    1287.58
Name: Close, Length: 3824, dtype: float64

In [27]:
pokemon.sort_values()

NameError: name 'pokemon' is not defined

In [28]:
pd.Series(data = ["Adam", "adam", "Ben"]).sort_values

<bound method Series.sort_values of 0    Adam
1    adam
2     Ben
dtype: object>

In [29]:
google.sort_values(ascending=False).head()

Date
2019-04-29    1287.58
2019-04-26    1272.18
2018-07-26    1268.33
2019-10-25    1265.13
2019-04-23    1264.55
Name: Close, dtype: float64

In [30]:
pokemon.sort_values(ascending=False).head()

NameError: name 'pokemon' is not defined

In [31]:
# 다음 두 줄은 결과가 동일합니다.
battles.sort_values()

Start Date
1781-09-06    Connecticut
1779-07-05    Connecticut
1777-04-27    Connecticut
1777-09-03       Delaware
1777-05-17        Florida
                 ...
1782-08-08            NaN
1782-08-25            NaN
1782-09-13            NaN
1782-10-18            NaN
1782-12-06            NaN
Name: State, Length: 232, dtype: object

In [32]:
battles.sort_values(na_position = "last")

Start Date
1781-09-06    Connecticut
1779-07-05    Connecticut
1777-04-27    Connecticut
1777-09-03       Delaware
1777-05-17        Florida
                 ...
1782-08-08            NaN
1782-08-25            NaN
1782-09-13            NaN
1782-10-18            NaN
1782-12-06            NaN
Name: State, Length: 232, dtype: object

In [33]:
battles.sort_values(na_position="first")

Start Date
1775-09-17         NaN
1775-12-31         NaN
1776-03-03         NaN
1776-03-25         NaN
1776-05-18         NaN
                ...
1781-07-06    Virginia
1781-07-01    Virginia
1781-06-26    Virginia
1781-04-25    Virginia
1783-01-22    Virginia
Name: State, Length: 232, dtype: object

In [34]:
battles.dropna().sort_values()

Start Date
1781-09-06    Connecticut
1779-07-05    Connecticut
1777-04-27    Connecticut
1777-09-03       Delaware
1777-05-17        Florida
                 ...
1781-07-06       Virginia
1781-07-01       Virginia
1781-06-26       Virginia
1781-04-25       Virginia
1783-01-22       Virginia
Name: State, Length: 162, dtype: object

### 3.2.2

In [35]:
# 다음 두 줄은 결과가 동일합니다.
pokemon.sort_index()

NameError: name 'pokemon' is not defined

In [36]:
pokemon.sort_index(ascending=True)

NameError: name 'pokemon' is not defined

In [37]:
battles.sort_index()

Start Date
1774-09-01    Massachusetts
1774-12-14    New Hampshire
1775-04-19    Massachusetts
1775-04-19    Massachusetts
1775-04-20         Virginia
                  ...
1783-01-22         Virginia
NaT              New Jersey
NaT                Virginia
NaT                     NaN
NaT                     NaN
Name: State, Length: 232, dtype: object

In [38]:
battles.sort_index(na_position="first").head()

Start Date
NaT              New Jersey
NaT                Virginia
NaT                     NaN
NaT                     NaN
1774-09-01    Massachusetts
Name: State, dtype: object

In [39]:
battles.sort_index(ascending=False).head()

Start Date
1783-01-22    Virginia
1782-12-06         NaN
1782-10-18         NaN
1782-09-13         NaN
1782-09-11    Virginia
Name: State, dtype: object

### 3.2.3

In [40]:
google.sort_values(ascending=False).head()

Date
2019-04-29    1287.58
2019-04-26    1272.18
2018-07-26    1268.33
2019-10-25    1265.13
2019-04-23    1264.55
Name: Close, dtype: float64

In [41]:
# 다음 두 줄은 결과가 동일합니다.
google.nlargest(n = 5)

Date
2019-04-29    1287.58
2019-04-26    1272.18
2018-07-26    1268.33
2019-10-25    1265.13
2019-04-23    1264.55
Name: Close, dtype: float64

In [42]:
google.nlargest()

Date
2019-04-29    1287.58
2019-04-26    1272.18
2018-07-26    1268.33
2019-10-25    1265.13
2019-04-23    1264.55
Name: Close, dtype: float64

In [43]:
# 다음 두 줄은 결과가 동일합니다.
google.nsmallest(n=5)

Date
2004-09-03    49.82
2004-09-01    49.94
2004-08-19    49.98
2004-09-02    50.57
2004-09-07    50.60
Name: Close, dtype: float64

In [44]:
google.nsmallest(5)

Date
2004-09-03    49.82
2004-09-01    49.94
2004-08-19    49.98
2004-09-02    50.57
2004-09-07    50.60
Name: Close, dtype: float64

## 3.3

In [45]:
battles.head(3)

Start Date
1774-09-01    Massachusetts
1774-12-14    New Hampshire
1775-04-19    Massachusetts
Name: State, dtype: object

In [46]:
battles.sort_values().head(3)

Start Date
1781-09-06    Connecticut
1779-07-05    Connecticut
1777-04-27    Connecticut
Name: State, dtype: object

In [47]:
battles.head(3)

Start Date
1774-09-01    Massachusetts
1774-12-14    New Hampshire
1775-04-19    Massachusetts
Name: State, dtype: object

In [48]:
battles.head(3)

Start Date
1774-09-01    Massachusetts
1774-12-14    New Hampshire
1775-04-19    Massachusetts
Name: State, dtype: object

In [49]:
# battles.sort_values(inplace=True)
battles.copy().sort_values(inplace=True)

In [50]:
# battles.sort_values(inplace=True)

In [51]:
battles = battles.sort_values()
battles

Start Date
1781-09-06    Connecticut
1779-07-05    Connecticut
1777-04-27    Connecticut
1777-09-03       Delaware
1777-05-17        Florida
                 ...
1782-08-08            NaN
1782-08-25            NaN
1782-09-13            NaN
1782-10-18            NaN
1782-12-06            NaN
Name: State, Length: 232, dtype: object

## 3.4

In [52]:
pokemon.head()

NameError: name 'pokemon' is not defined

In [53]:
pokemon.value_counts()

NameError: name 'pokemon' is not defined

In [54]:
len(pokemon.value_counts())

NameError: name 'pokemon' is not defined

In [55]:
pokemon.nunique()

NameError: name 'pokemon' is not defined

In [56]:
pokemon.value_counts(ascending=True)

NameError: name 'pokemon' is not defined

In [57]:
pokemon.value_counts(normalize=True).head()

NameError: name 'pokemon' is not defined

In [58]:
pokemon.value_counts(normalize=True).head()*100

NameError: name 'pokemon' is not defined

In [59]:
(pokemon.value_counts(normalize=True)*100).round(2)

NameError: name 'pokemon' is not defined

In [60]:
google.value_counts().head()

Close
287.68    3
194.27    3
307.10    3
288.92    3
290.41    3
Name: count, dtype: int64

In [61]:
google.max()

1287.58

In [62]:
google.min()

49.82

In [63]:
buckets = [0, 200, 400, 600, 800, 1000, 1200, 1400]
google.value_counts(bins = buckets)

Close
(200.0, 400.0]      1568
(-0.001, 200.0]      595
(400.0, 600.0]       575
(1000.0, 1200.0]     406
(600.0, 800.0]       380
(800.0, 1000.0]      207
(1200.0, 1400.0]      93
Name: count, dtype: int64

In [64]:
google.value_counts(bins=buckets).sort_index()

Close
(-0.001, 200.0]      595
(200.0, 400.0]      1568
(400.0, 600.0]       575
(600.0, 800.0]       380
(800.0, 1000.0]      207
(1000.0, 1200.0]     406
(1200.0, 1400.0]      93
Name: count, dtype: int64

In [65]:
google.value_counts(bins=buckets, sort= False)

Close
(-0.001, 200.0]      595
(200.0, 400.0]      1568
(400.0, 600.0]       575
(600.0, 800.0]       380
(800.0, 1000.0]      207
(1000.0, 1200.0]     406
(1200.0, 1400.0]      93
Name: count, dtype: int64

In [66]:
google.value_counts(bins=6, sort=False)

Close
(48.581, 256.113]      1204
(256.113, 462.407]     1104
(462.407, 668.7]        507
(668.7, 874.993]        380
(874.993, 1081.287]     292
(1081.287, 1287.58]     337
Name: count, dtype: int64

In [67]:
battles.head()

Start Date
1781-09-06    Connecticut
1779-07-05    Connecticut
1777-04-27    Connecticut
1777-09-03       Delaware
1777-05-17        Florida
Name: State, dtype: object

In [68]:
battles.value_counts().head()

State
South Carolina    31
New York          28
New Jersey        24
Virginia          21
Massachusetts     11
Name: count, dtype: int64

In [69]:
battles.value_counts(dropna=False).head()

State
NaN               70
South Carolina    31
New York          28
New Jersey        24
Virginia          21
Name: count, dtype: int64

In [70]:
battles.index

DatetimeIndex(['1781-09-06', '1779-07-05', '1777-04-27', '1777-09-03',
               '1777-05-17', '1779-09-10', '1779-09-07', '1780-03-02',
               '1778-06-30', '1781-01-07',
               ...
               '1782-05-06', '1782-05-25', '1782-05-28', '1782-07-01',
               '1782-07-06', '1782-08-08', '1782-08-25', '1782-09-13',
               '1782-10-18', '1782-12-06'],
              dtype='datetime64[ns]', name='Start Date', length=232, freq=None)

In [71]:
battles.index.value_counts()

Start Date
1781-05-22    2
1775-04-19    2
1782-03-16    2
1782-01-11    2
1781-04-25    2
             ..
1776-09-15    1
1776-10-11    1
1777-10-06    1
1780-11-23    1
1782-12-06    1
Name: count, Length: 217, dtype: int64

## 3.5

In [72]:
funcs=[len, max, min]

In [73]:
for current_func in funcs:
    print(current_func(google))

3824
1287.58
49.82

In [74]:
round(99.2)

99

In [75]:
round(99.49)

99

In [76]:
round(99.5)

100

In [77]:
# 다음 두 줄은 결과가 동일합니다.
google.apply(func=round)

Date
2004-08-19      50
2004-08-20      54
2004-08-23      54
2004-08-24      52
2004-08-25      53
              ...
2019-10-21    1246
2019-10-22    1243
2019-10-23    1259
2019-10-24    1261
2019-10-25    1265
Name: Close, Length: 3824, dtype: int64

In [78]:
google.apply(round)

Date
2004-08-19      50
2004-08-20      54
2004-08-23      54
2004-08-24      52
2004-08-25      53
              ...
2019-10-21    1246
2019-10-22    1243
2019-10-23    1259
2019-10-24    1261
2019-10-25    1265
Name: Close, Length: 3824, dtype: int64

In [79]:
def single_or_multi(pokemon_type):
    if "/" in pokemon_type:
        return "Multi"
    return "Single"

In [80]:
pokemon.head(4)

NameError: name 'pokemon' is not defined

In [81]:
pokemon.apply(single_or_multi)

NameError: name 'pokemon' is not defined

In [82]:
pokemon.apply(single_or_multi).value_counts()

NameError: name 'pokemon' is not defined

## 3.6 코딩챌린지

In [83]:
import datetime as dt
today = dt.datetime(2024, 1, 15)
today.strftime("%A")

'Monday'

In [84]:
rev = pd.read_csv("../DATA/revolutionary_war.csv")
rev

                                Battle  Start Date          State
0                         Powder Alarm    9/1/1774  Massachusetts
1    Storming of Fort William and Mary  12/14/1774  New Hampshire
2     Battles of Lexington and Concord   4/19/1775  Massachusetts
3                      Siege of Boston   4/19/1775  Massachusetts
4                   Gunpowder Incident   4/20/1775       Virginia
..                                 ...         ...            ...
227                Siege of Fort Henry   9/11/1782       Virginia
228         Grand Assault on Gibraltar   9/13/1782            NaN
229          Action of 18 October 1782  10/18/1782            NaN
230          Action of 6 December 1782   12/6/1782            NaN
231          Action of 22 January 1783   1/22/1783       Virginia

[232 rows x 3 columns]

In [85]:
rev2 = pd.read_csv("../DATA/revolutionary_war.csv",
            usecols=["Start Date"],
            parse_dates=["Start Date"]).squeeze()

def week(date):
    return date.strftime("%A")

rev2.dropna().apply(week).value_counts()


# rev2.apply(week)

#순서 겁나 헷갈리는데 정확히 기억하자

Start Date
Saturday     39
Friday       39
Wednesday    32
Thursday     31
Sunday       31
Tuesday      29
Monday       27
Name: count, dtype: int64

# 5

## 5.1

In [86]:
import pandas as pd

In [87]:
pd.read_csv("../DATA/employees.csv")

     First Name  Gender Start Date    Salary   Mgmt          Team
0       Douglas    Male     8/6/93       NaN   True     Marketing
1        Thomas    Male    3/31/96   61933.0   True           NaN
2         Maria  Female        NaN  130590.0  False       Finance
3         Jerry     NaN     3/4/05  138705.0   True       Finance
4         Larry    Male    1/24/98  101004.0   True            IT
...         ...     ...        ...       ...    ...           ...
996     Phillip    Male    1/31/84   42392.0  False       Finance
997     Russell    Male    5/20/13   96914.0  False       Product
998       Larry    Male    4/20/13   60500.0  False  Business Dev
999      Albert    Male    5/15/12  129949.0   True         Sales
1000        NaN     NaN        NaN       NaN    NaN           NaN

[1001 rows x 6 columns]

In [88]:
pd.read_csv("../DATA/employees.csv", parse_dates=["Start Date"]).head()

/var/folders/9y/lpn0hjmn5csct06t4_r5qtjr0000gn/T/ipykernel_32414/4114072625.py:1: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  pd.read_csv("../DATA/employees.csv", parse_dates=["Start Date"]).head()

  First Name  Gender Start Date    Salary   Mgmt       Team
0    Douglas    Male 1993-08-06       NaN   True  Marketing
1     Thomas    Male 1996-03-31   61933.0   True        NaN
2      Maria  Female        NaT  130590.0  False    Finance
3      Jerry     NaN 2005-03-04  138705.0   True    Finance
4      Larry    Male 1998-01-24  101004.0   True         IT

In [89]:
employees = pd.read_csv("../DATA/employees.csv", parse_dates=["Start Date"])

/var/folders/9y/lpn0hjmn5csct06t4_r5qtjr0000gn/T/ipykernel_32414/1058059249.py:1: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  employees = pd.read_csv("../DATA/employees.csv", parse_dates=["Start Date"])

In [90]:
employees.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1001 entries, 0 to 1000
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   First Name  933 non-null    object
 1   Gender      854 non-null    object
 2   Start Date  999 non-null    datetime64[ns]
 3   Salary      999 non-null    float64
 4   Mgmt        933 non-null    object
 5   Team        957 non-null    object
dtypes: datetime64[ns](1), float64(1), object(4)
memory usage: 47.1+ KB

### 5.1.1

In [91]:
employees["Mgmt"].astype(bool)

0        True
1        True
2       False
3        True
4        True
        ...
996     False
997     False
998     False
999      True
1000     True
Name: Mgmt, Length: 1001, dtype: bool

In [92]:
employees["Mgmt"] = employees["Mgmt"].astype(bool)

In [93]:
employees.tail()

     First Name Gender Start Date    Salary   Mgmt          Team
996     Phillip   Male 1984-01-31   42392.0  False       Finance
997     Russell   Male 2013-05-20   96914.0  False       Product
998       Larry   Male 2013-04-20   60500.0  False  Business Dev
999      Albert   Male 2012-05-15  129949.0   True         Sales
1000        NaN    NaN        NaT       NaN   True           NaN

In [94]:
employees.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1001 entries, 0 to 1000
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   First Name  933 non-null    object
 1   Gender      854 non-null    object
 2   Start Date  999 non-null    datetime64[ns]
 3   Salary      999 non-null    float64
 4   Mgmt        1001 non-null   bool
 5   Team        957 non-null    object
dtypes: bool(1), datetime64[ns](1), float64(1), object(3)
memory usage: 40.2+ KB

In [95]:
employees["Salary"].astype(int)

IntCastingNaNError: Cannot convert non-finite values (NA or inf) to integer

In [ ]:
employees["Salary"].fillna(0).tail()

In [ ]:
employees["Salary"].fillna(0).astype(int).tail()

In [ ]:
employees["Salary"]=employees["Salary"].fillna(0).astype(int)

In [ ]:
employees.nunique()

In [ ]:
employees["Gender"].astype("category")

In [ ]:
employees["Gender"] =employees["Gender"].astype("category")

In [ ]:
employees["Team"] = employees["Team"].astype("category")

In [ ]:
employees.info()

## 5.2

In [96]:
"Maria" == "Maria"

True

In [97]:
"Maria" == "Taylor"

False

In [98]:
# Series ==value

In [99]:
employees["First Name"] == "Maria"

0       False
1       False
2        True
3       False
4       False
        ...
996     False
997     False
998     False
999     False
1000    False
Name: First Name, Length: 1001, dtype: bool

In [100]:
employees[employees["First Name"] == "Maria"]

    First Name  Gender Start Date    Salary   Mgmt          Team
2        Maria  Female        NaT  130590.0  False       Finance
198      Maria  Female 1990-12-27   36067.0   True       Product
815      Maria     NaN 1986-01-18  106562.0  False            HR
844      Maria     NaN 1985-06-19  148857.0  False         Legal
936      Maria  Female 2003-03-14   96250.0  False  Business Dev
984      Maria  Female 2011-10-15   43455.0  False   Engineering

In [101]:
marias = employees["First Name"] =="Maria"
employees[marias]

    First Name  Gender Start Date    Salary   Mgmt          Team
2        Maria  Female        NaT  130590.0  False       Finance
198      Maria  Female 1990-12-27   36067.0   True       Product
815      Maria     NaN 1986-01-18  106562.0  False            HR
844      Maria     NaN 1985-06-19  148857.0  False         Legal
936      Maria  Female 2003-03-14   96250.0  False  Business Dev
984      Maria  Female 2011-10-15   43455.0  False   Engineering

In [102]:
"Finance" != "Engineering"

True

In [103]:
employees["Team"] != "Finance"

0        True
1        True
2       False
3       False
4        True
        ...
996     False
997      True
998      True
999      True
1000     True
Name: Team, Length: 1001, dtype: bool

## 5.3

### 5.3.1

In [104]:
is_female = employees["Gender"]=="Female"

In [105]:
in_biz_dev = employees["Team"] == "Business Dev"

In [106]:
employees[is_female & in_biz_dev].head()

   First Name  Gender Start Date    Salary   Mgmt          Team
9     Frances  Female 2002-08-08  139852.0   True  Business Dev
33       Jean  Female 1993-12-18  119082.0  False  Business Dev
36     Rachel  Female 2009-02-16  142032.0  False  Business Dev
38  Stephanie  Female 1986-09-13   36844.0   True  Business Dev
61     Denise  Female 2001-11-06  106862.0  False  Business Dev

In [107]:
is_manager = employees["Mgmt"]
employees[is_female & in_biz_dev & is_manager].head()

    First Name  Gender Start Date    Salary  Mgmt          Team
9      Frances  Female 2002-08-08  139852.0  True  Business Dev
38   Stephanie  Female 1986-09-13   36844.0  True  Business Dev
66       Nancy  Female 2012-12-15  125250.0  True  Business Dev
92       Linda  Female 2000-05-25  119009.0  True  Business Dev
111     Bonnie  Female 1999-12-17   42153.0  True  Business Dev

In [108]:
earning_below_40k = employees["Salary"]<40000
started_after_2015 = employees["Start Date"] > "2015-01-01"
employees[earning_below_40k | started_after_2015].tail()

    First Name  Gender Start Date    Salary   Mgmt          Team
949      Scott    Male 2011-08-20   37385.0   True  Business Dev
958     Gloria  Female 1987-10-24   39833.0  False   Engineering
964      Bruce    Male 1980-05-07   35802.0   True         Sales
967     Thomas    Male 2016-03-12  105681.0  False   Engineering
989     Justin     NaN 1991-02-10   38344.0  False         Legal

In [109]:
my_series = pd.Series([True, False, True])
my_series

0     True
1    False
2     True
dtype: bool

In [110]:
~my_series

0    False
1     True
2    False
dtype: bool

In [111]:
employees[employees["Salary"]<100000].head()

   First Name  Gender Start Date   Salary  Mgmt         Team
1      Thomas    Male 1996-03-31  61933.0  True          NaN
6        Ruby  Female 1987-08-17  65476.0  True      Product
7         NaN  Female 2015-07-20  45906.0  True      Finance
8      Angela  Female 2005-11-22  95570.0  True  Engineering
10     Louise  Female 1980-08-12  63241.0  True          NaN

In [112]:
employees[~(employees["Salary"] > 100000)].head()

  First Name  Gender Start Date   Salary  Mgmt         Team
0    Douglas    Male 1993-08-06      NaN  True    Marketing
1     Thomas    Male 1996-03-31  61933.0  True          NaN
6       Ruby  Female 1987-08-17  65476.0  True      Product
7        NaN  Female 2015-07-20  45906.0  True      Finance
8     Angela  Female 2005-11-22  95570.0  True  Engineering

### 5.3.2

In [113]:
earning_below_40k = employees["Salary"] < 40000
started_after_2015 = employees["Start Date"] > "2015-01-01"

In [114]:
is_female = employees["Gender"] == "Female"

In [115]:
in_biz_dev = employees["Team"] == "Business Dev"

In [116]:
employees[is_female & in_biz_dev].head()

   First Name  Gender Start Date    Salary   Mgmt          Team
9     Frances  Female 2002-08-08  139852.0   True  Business Dev
33       Jean  Female 1993-12-18  119082.0  False  Business Dev
36     Rachel  Female 2009-02-16  142032.0  False  Business Dev
38  Stephanie  Female 1986-09-13   36844.0   True  Business Dev
61     Denise  Female 2001-11-06  106862.0  False  Business Dev

In [118]:
is_manager= employees["Mgmt"]
employees[is_female & in_biz_dev & is_manager].head()

    First Name  Gender Start Date    Salary  Mgmt          Team
9      Frances  Female 2002-08-08  139852.0  True  Business Dev
38   Stephanie  Female 1986-09-13   36844.0  True  Business Dev
66       Nancy  Female 2012-12-15  125250.0  True  Business Dev
92       Linda  Female 2000-05-25  119009.0  True  Business Dev
111     Bonnie  Female 1999-12-17   42153.0  True  Business Dev

### 5.3.2 OR 조건

In [120]:
earning_below_40k = employees["Salary"] < 40000
started_after_2015 = employees["Start Date"] > "2015-01-01"

In [122]:
employees[earning_below_40k | started_after_2015].tail()

    First Name  Gender Start Date    Salary   Mgmt          Team
949      Scott    Male 2011-08-20   37385.0   True  Business Dev
958     Gloria  Female 1987-10-24   39833.0  False   Engineering
964      Bruce    Male 1980-05-07   35802.0   True         Sales
967     Thomas    Male 2016-03-12  105681.0  False   Engineering
989     Justin     NaN 1991-02-10   38344.0  False         Legal

### 5.3.3 ~기호로 반전

In [123]:
my_series = pd.Series([True, False, True])
my_series

0     True
1    False
2     True
dtype: bool

In [124]:
~my_series

0    False
1     True
2    False
dtype: bool

In [128]:
employees[employees["Salary"] < 100000].head()

   First Name  Gender Start Date   Salary  Mgmt         Team
1      Thomas    Male 1996-03-31  61933.0  True          NaN
6        Ruby  Female 1987-08-17  65476.0  True      Product
7         NaN  Female 2015-07-20  45906.0  True      Finance
8      Angela  Female 2005-11-22  95570.0  True  Engineering
10     Louise  Female 1980-08-12  63241.0  True          NaN

In [129]:
employees[employees["Salary"] > 100000].head()

  First Name  Gender Start Date    Salary   Mgmt          Team
2      Maria  Female        NaT  130590.0  False       Finance
3      Jerry     NaN 2005-03-04  138705.0   True       Finance
4      Larry    Male 1998-01-24  101004.0   True            IT
5     Dennis    Male 1987-04-18  115163.0  False         Legal
9    Frances  Female 2002-08-08  139852.0   True  Business Dev

### 5.3.4 불리언 메서드

== , !=, >, >=, <, <=,

## 5.4

### 5.4.1

# 12

## 12.1

In [ ]:
'''
"name" : "Harry Potter"

{"name" : "Harry Potter", "age":17, "wizard":true}

{"name" : "Harry Potter", 
 "age":17,
 "wizard":true}
 
{"name" : "Harry Potter", 
 "age":17,
 "wizard":true}

{"name" : "Harry Potter", 
 "age":17,
 "wizard":true
 "friends":["Ron Weasley", "Hermione Granger"]}
 
 {"name" : "Harry Potter", 
 "age":17,
 "wizard":true
 "friends":["Ron Weasley", "Hermione Granger"]
 "adress": {
     "street": "4 Privet Drive",
     "town": "Little Whinging"
     }
 }
 

'''

In [ ]:
import pandas as pd

In [ ]:
nobel = pd.read_json("../DATA/nobel.json")
nobel.head()

In [ ]:
nobel.loc[2, "prizes"]

In [ ]:
type(nobel.loc[2, "prizes"])

In [ ]:
chemistry_2019 = nobel.loc[0, "prizes"]
chemistry_2019

In [ ]:
pd.json_normalize(data = chemistry_2019)

In [ ]:
pd.json_normalize(data = chemistry_2019, record_path = "laureates")

In [ ]:
pd.json_normalize(
    data = chemistry_2019,
    record_path = "laureates",
    meta = ["year", "category"]
)

In [ ]:
# pd.json_normalize(
#     data = nobel["prizes"],
#     record_path = "laureates",
#     meta = ["year", "category"]
# )

In [ ]:
cheese_consumption = {
    "France": 57.9,
    "Germany": 53.2,
    "Luxembourg": 53.2
}
cheese_consumption

In [ ]:
cheese_consumption.setdefault("France", 100)

In [ ]:
cheese_consumption["France"]

In [ ]:
cheese_consumption.setdefault("Italy", 48)

In [ ]:
cheese_consumption

In [ ]:
def add_laureates_key(entry):
    entry.setdefault("laureates",[])

nobel["prizes"].apply(add_laureates_key)

In [ ]:
winners = pd.json_normalize(
    data = nobel["prizes"],
    record_path = "laureates",
    meta = ["year", "category"]
)

winners

### 12.1.2

In [ ]:
winners.head(2)

In [ ]:
winners.head(2).to_json(orient = "records")

In [ ]:
winners.to_json("winners.json", orient = "records")

## 12. 2

In [ ]:
url = "https://data.cityofnewyork.us/api/views/25th-nujf/rows.csv"
baby_names = pd.read_csv(url)
baby_names.head()

In [ ]:
baby_names.head(10).to_csv()

In [ ]:
baby_names.head(10).to_csv(index = False)

In [ ]:
baby_names.to_csv(
    "NYC_Baby_Names.csv",
    index = False)

In [ ]:
baby_names

In [ ]:
baby_names.to_csv(
    "NYC_Baby_Names.csv",
    index = False, 
    columns = ["Gender", "Child's First Name", "Count"]
)

## 12.3

### 12.3.1

In [ ]:
pd.read_excel("../DATA/Single Worksheet.xlsx")

In [ ]:
pd.read_excel(
    io = "../DATA/Single Worksheet.xlsx",
    usecols = ["City", "First Name", "Last Name"],
    index_col = "City"
)

In [ ]:
pd.read_excel("../DATA/Multiple Worksheets.xlsx")

In [ ]:
# 다음 두 줄은 결과가 동일합니다.
pd.read_excel("../DATA/Multiple Worksheets.xlsx", sheet_name = 0)

In [ ]:
pd.read_excel("../DATA/Multiple Worksheets.xlsx", sheet_name = "Data 1")

In [ ]:
workbook = pd.read_excel(
    "../DATA/Multiple Worksheets.xlsx", sheet_name = None
)

workbook

In [ ]:
type(workbook)

In [ ]:
workbook["Data 2"]

In [ ]:
pd.read_excel(
    "../DATA/Multiple Worksheets.xlsx",
    sheet_name = ["Data 1", "Data 3"]
)

In [ ]:
pd.read_excel("../DATA/Multiple Worksheets.xlsx", sheet_name = [1, 2])

### 12.3.3

In [ ]:
baby_names.head()

In [ ]:
girls = baby_names[baby_names["Gender"] == "FEMALE"]
boys = baby_names[baby_names["Gender"] == "MALE"]

In [ ]:
excel_file = pd.ExcelWriter("Baby_Names.xlsx")

In [ ]:
excel_file

In [ ]:
girls.to_excel(
    excel_writer = excel_file, sheet_name="Girls", index = False)

In [ ]:
boys.to_excel(
    excel_file, 
    sheet_name="Boys", 
    index = False,
    columns = ["Child's First Name", "Count", "Rank"])

In [ ]:
excel_file.save()

## 12.4

In [ ]:
tv_shows_json = pd.read_json("../DATA/tv_shows.json")
tv_shows_json

In [ ]:
tv_shows_json.loc[0, "shows"]

In [ ]:
tv_shows = pd.json_normalize(
    data = tv_shows_json["shows"],
    record_path="episodes",
    meta=["show", "runtime", "network"])
tv_shows

In [ ]:
xfiles = tv_shows[tv_shows["show"] == "The X-Files"]
lost = tv_shows[tv_shows["show"] == "Lost"]
buffy = tv_shows[tv_shows["show"] == "Buffy the Vampire Slayer"]

xfiles = tv_shows[tv_shows["show"] == "The X-Files"]
lost = tv_shows[tv_shows["show"] == "Lost"]
buffy = tv_shows[tv_shows["show"] == "Buffy the Vampire Slayer"]

In [ ]:
episodes = pd.ExcelWriter("episodes.xlsx")
episodes